app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(title: params[:school_class][:title], room_number: params[:school_class][:room_number])
        # byebug
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Class name"], ["room_number", 5], ["created_at", "2021-02-24 00:40:02.722072"], ["updated_at", "2021-02-24 00:40:02.722072"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 20], ["updated_at", "2021-02-24 00:52:48.965261"], ["id", 1]]